Repository: xfce-mirror/xfce4-dict
Catalog: po/*.po
Languages: ro, vi

source: Dictionary
ro: Dicționar
vi: Từ điển

source: A plugin to query different dictionaries.
ro: Modul pentru interogarea diferitelor dicționare.
vi: Phần mở rộng để tra cứu các từ điển khác nhau.

source: Ready
ro: Gata
vi: Sẵn sàng

source: Look up a word
ro: Caută un cuvânt
vi: Tra từ

source: Search term
ro: Caută termen
vi: Từ cần tra

source: Dictionary Server
ro: Server de dicționar
vi: Máy chủ từ điển

source: Web Service
ro: Serviciu web
vi: Dịch vụ web

source: Spell Checker
ro: Corector ortografic
vi: Kiểm tra chính tả

source: Search the given text using a Dict server(RFC 2229)
ro: Caută textul dat folosind un server Dict (RFC 2229)
vi: Tra văn bản đã cho bằng máy chủ Dict (RFC 2229)

source: Search the given text using a web-based search engine
ro: Caută textul dat folosind un motor de căutare web
vi: Tra văn bản đã cho bằng công cụ tìm kiếm web

source: Check the given text with a spell checker
ro: Verifică textul dat cu un corector ortografic
vi: Kiểm tra chính tả văn bản đã cho

source: Generate the definition of the given text with a large language model
ro: Generează definiția textului dat cu un model lingvistic mare
vi: Tạo định nghĩa cho văn bản đã cho bằng mô hình ngôn ngữ lớn

source: Start stand-alone application even if the panel plugin is loaded
ro: Lansează aplicația chiar dacă modulul pentru panou este încărcat
vi: Khởi động ứng dụng độc lập ngay cả khi phần mở rộng bảng điều khiển đã được nạp

source: Grabs the PRIMARY selection content and uses it as search text
ro: Preia conținutul selecției PRIMARE și îl utilizează ca text de căutare
vi: Lấy nội dung vùng chọn PRIMARY và dùng làm từ tra

source: Be verbose
ro: Oferă informații detaliate la ieșire
vi: Hiển thị chi tiết

source: Show version information
ro: Afișează informații despre versiune
vi: Hiển thị thông tin phiên bản

source: [TEXT]
vi: [VĂN BẢN]

source: Please report bugs to <%s>.
ro: Raportați problemele la <%s>.
vi: Vui lòng báo lỗi tới <%s>.

source: Dictionary Client
ro: Program client de dicționar
vi: Ứng dụng Từ điển

source: A client program to query different dictionaries
ro: Un program client pentru consultarea diferitelor dicționare
vi: Chương trình tra cứu các từ điển khác nhau

source: Spell Checker Results:
ro: Rezultatele verificării ortografice:
vi: Kết quả kiểm tra chính tả:

source: %d suggestion found.
ro: o sugestie găsită.
vi: Tìm thấy %d gợi ý.

source: Suggestions for "%s" (%s):
ro: Sugestii pentru „%s” (%s):
vi: Gợi ý cho "%s" (%s):

source: "%s" is spelled correctly (%s).
ro: „%s” este scris corect (%s).
vi: "%s" viết đúng chính tả (%s).

source: No suggestions could be found for "%s" (%s).
ro: Nu s-au găsit sugestii pentru „%s” (%s).
vi: Không tìm thấy gợi ý nào cho "%s" (%s).

source: Error while executing "%s" (%s).
ro: Eroare în timpul execuției „%s” (%s).
vi: Lỗi khi thực thi "%s" (%s).

source: Please set the spell check command in the preferences dialog.
ro: Definiți comanda de verificare a ortografiei în dialogul de preferințe.
vi: Vui lòng đặt lệnh kiểm tra chính tả trong hộp thoại tùy chọn.

source: Invalid input
ro: Intrare nevalidă
vi: Đầu vào không hợp lệ

source: Process failed (%s)
ro: Procesul a eșuat (%s)
vi: Tiến trình thất bại (%s)

source: P_ause
ro: P_auză
vi: Tạm _dừng

source: _Resume
ro: _Reluare
vi: _Tiếp tục

source: S_top
vi: _Dừng

source: Running
ro: Rulând
vi: Đang chạy

source: Finished
ro: Încheiat
vi: Hoàn thành

source: _Back
ro: Înap_oi
vi: _Quay lại

source: Speed Reader
ro: Lector rapid
vi: Đọc tốc độ

source: You must enter a text.
ro: Trebuie să introduceți un text.
vi: Bạn phải nhập văn bản.

source: Choose a file to load
ro: Alegeți un fișier pentru încărcare
vi: Chọn tập tin để nạp

source: _Cancel
ro: _Renunță
vi: _Hủy bỏ

source: _Open
ro: _Deschide
vi: _Mở

source: The file '%s' could not be loaded.
ro: Fișierul „%s” nu a putut fi încărcat.
vi: Không thể nạp tập tin '%s'.

source: (display %d word at a time)
ro: (afișează %d cuvânt odată)
vi: (hiển thị %d từ mỗi lần)

source: This is an easy speed reading utility to help train you to read faster. It does this by flashing words at a rapid rate on the screen.
ro: Acesta este un instrument de citire rapidă pentru a vă antrena să citiți mai repede. Face acest lucru prin afișarea pe ecran a cuvintelor la o viteză rapidă.
vi: Đây là tiện ích đọc nhanh đơn giản giúp bạn luyện đọc nhanh hơn. Nó hoạt động bằng cách hiện từ với tốc độ cao trên màn hình.

source: _Words per Minute:
ro: _Cuvinte pe minut:
vi: _Từ/phút:

source: _Mark Paragraphs
ro: _Marchează paragrafele
vi: Đánh _dấu đoạn văn

source: Word _Grouping:
ro: Grupări de cuvinte:
vi: _Nhóm từ:

source: _Font Size:
ro: Dimensiune _font:
vi: _Cỡ chữ:

source: Enter some text here you would like to read. Be relaxed and make yourself comfortable, then press Start to begin speed reading.
ro: Introduceți aici un text pe care doriți să îl citiți. Relaxați-vă și făceți-vă comod, apoi apăsați Start pentru a începe citirea rapidă.
vi: Nhập văn bản bạn muốn đọc vào đây. Thư giãn và thoải mái, sau đó nhấn Bắt đầu để đọc nhanh.

source: Load the contents of a file
ro: Încărcați conținutul unui fișier
vi: Nạp nội dung tập tin

source: Clear the contents of the text field and paste the contents of the clipboard
ro: Șterge conținutul câmpului de text și lipește conținutul din clipboard
vi: Xóa nội dung ô văn bản và dán từ clipboard

source: Clear the contents of the text field
ro: Șterge conținutul câmpului de text
vi: Xóa nội dung ô văn bản

source: _Start
vi: _Bắt đầu

source: _Close
ro: În_chide
vi: _Đóng

source: The search URL is empty. Please check your preferences.
ro: Adresa URL de căutare este goală. Verificați-vă preferințele.
vi: URL tìm kiếm trống. Vui lòng kiểm tra tùy chọn.

source: Browser could not be opened. Please check your preferences.
ro: Navigatorul web nu a putut fi deschis. Verificați-vă preferințele.
vi: Không mở được trình duyệt. Vui lòng kiểm tra tùy chọn.

source: Invalid non-UTF8 input
ro: Intrare non-UTF8 nevalidă
vi: Đầu vào không phải UTF-8 hợp lệ

source: Error
ro: Eroare
vi: Lỗi

source: warning
ro: avertisment
vi: cảnh báo

source: Search "%s" using "%s"
ro: Caută „%s” folosind „%s”
vi: Tìm "%s" bằng "%s"

source: Web Search:
ro: Căutare web:
vi: Tìm kiếm web:

source: Could not connect to server.
ro: Nu s-a putut stabili conexiunea cu serverul.
vi: Không thể kết nối tới máy chủ.

source: The server is not ready.
ro: Serverul nu este încă gata.
vi: Máy chủ chưa sẵn sàng.

source: Invalid dictionary specified. Please check your preferences.
ro: Dicționarul specificat nu este valid. Verificați-vă preferințele.
vi: Từ điển không hợp lệ. Vui lòng kiểm tra tùy chọn.

source: Unknown error while querying the server.
ro: Eroare necunoscută în timpul interogării serverului.
vi: Lỗi không xác định khi truy vấn máy chủ.

source: Dictionary Results:
ro: Rezultatele dicționarului:
vi: Kết quả từ điển:

source: No matches could be found for "%s".
ro: Nu s-a găsit nicio potrivire pentru „%s”.
vi: Không tìm thấy kết quả nào cho "%s".

source: %d definition found.
ro: %d definiție găsită.
vi: Tìm thấy %d định nghĩa.

source: Querying %s...
ro: Se interoghează %s...
vi: Đang truy vấn %s...

source: An error occurred while querying server information.
ro: A apărut o eroare în timpul interogării informațiilor de la server.
vi: Có lỗi khi truy vấn thông tin máy chủ.

source: Server Information for "%s"
ro: Informații de la server pentru „%s”
vi: Thông tin máy chủ cho "%s"

source: The server doesn't offer any databases.
ro: Serverul nu oferă nicio bază de date.
vi: Máy chủ không cung cấp cơ sở dữ liệu nào.

source: Copy Link
ro: Copiază legătura
vi: Sao chép liên kết

source: Search
ro: Căutare
vi: Tìm kiếm

source: F_ind
ro: _Găsește
vi: _Tìm

source: _File
ro: _Fișier
vi: _Tập tin

source: Speed _Reader
ro: _Lector rapid
vi: Đọ_c nhanh

source: _Preferences
ro: _Preferințe
vi: _Tùy chọn

source: _Quit
ro: _Ieșire
vi: _Thoát

source: _Help
ro: _Ajutor
vi: Trợ _giúp

source: About
ro: Despre
vi: Giới thiệu

source: Search with:
ro: Caută cu:
vi: Tra bằng:

source: _Dictionary Server
ro: Server de _dicționar
vi: Máy _chủ từ điển

source: _Web Service
ro: Serviciu _web
vi: Dịch vụ _Web

source: _Spell Checker
ro: Corector _ortografic
vi: Kiểm _tra chính tả

source: A client program to query different dictionaries.
ro: Un program client pentru consultarea diferitelor dicționare.
vi: Chương trình tra cứu các từ điển khác nhau.

source: translator-credits
ro: Marius Ghita, 2022 Remus-Gabriel Chelu <remusgabriel.chelu@disroot.org>, 2024, 2025
vi: Nhóm Việt hóa Xfce

source: Xfce4 Dictionary
ro: Dicționar Xfce4
vi: Từ điển Xfce4

source: dict.leo.org - German <-> English
ro: dict.leo.org - Germană <-> Engleză
vi: dict.leo.org - Đức ⇔ Anh

source: dict.leo.org - German <-> French
ro: dict.leo.org - Germană <-> Franceză
vi: dict.leo.org - Đức ⇔ Pháp

source: dict.leo.org - German <-> Spanish
ro: dict.leo.org - Germană <-> Spaniolă
vi: dict.leo.org - Đức ⇔ Tây Ban Nha

source: dict.leo.org - German <-> Italian
ro: dict.leo.org - Germană <-> Italiană
vi: dict.leo.org - Đức ⇔ Ý

source: dict.leo.org - German <-> Chinese
ro: dict.leo.org - Germană <-> Chineză
vi: dict.leo.org - Đức ⇔ Trung

source: dict.cc - Dictionary
ro: dict.cc - Dicționar
vi: dict.cc - Từ điển

source: Wikipedia, the free encyclopedia (EN)
ro: Wikipedia, enciclopedia liberă (EN)
vi: Wikipedia, bách khoa toàn thư mở (Anh)

source: Wiktionary, the free dictionary (EN)
ro: Wikționar, dicționarul liber (EN)
vi: Wiktionary, từ điển mở (Anh)

source: Merriam-Webster Online Dictionary
ro: Dicționarul în linie Merriam-Webster
vi: Từ điển trực tuyến Merriam-Webster

source: Clear
ro: Șterge
vi: Xóa

source: You have chosen an invalid dictionary.
ro: Ați ales un dicționar nevalid.
vi: Bạn đã chọn từ điển không hợp lệ.

source: General
ro: Generale
vi: Chung

source: <b>Default search method:</b>
ro: <b>Metoda de căutare implicită:</b>
vi: <b>Phương pháp tra cứu mặc định:</b>

source: Last used method
ro: Ultima metodă utilizată
vi: Phương pháp dùng lần cuối

source: <b>Colors:</b>
ro: <b>Culori</b>
vi: <b>Màu sắc:</b>

source: Links:
ro: Legături:
vi: Liên kết:

source: Phonetics:
ro: Fonetică:
vi: Phiên âm:

source: Spelled correctly:
ro: Scris corect:
vi: Viết đúng:

source: Spelled incorrectly:
ro: Scris incorect:
vi: Viết sai:

source: <b>Panel Text Field:</b>
ro: Câmpul de text al panoului:
vi: <b>Ô nhập bảng điều khiển:</b>

source: Show text field in the panel
ro: Afișează câmpul de text în panou
vi: Hiển thị trường văn bản trong bảng điều khiển

source: Text field size:
ro: Dimensiunea câmpului de text:
vi: Kích cỡ ô nhập liệu:

source: Server:
vi: Máy chủ:

source: Server Port:
ro: Portul serverului.
vi: Cổng:

source: Dictionary:
ro: Dicționar:
vi: Từ điển:

source: * (use all)
ro: * (toate)
vi: *(dùng tất cả)

source: ! (use all, stop after first match)
ro: ! (toate, se oprește după prima potrivire)
vi: ! (dùng tất cả, dừng sau lần đúng đầu tiên)

source: <b>Web search URL:</b>
ro: <b>Adresa URL de căutare în Internet:</b>
vi: <b>URL tìm kiếm web:</b>

source: Enter the URL of a web site which offers translation or dictionary services. Use {word} as placeholder for the searched word.
ro: Introduceți adresa URL a unui sit web care oferă servicii de traducere sau dicționare. Utilizați {cuvânt} ca înlocuitor pentru cuvântul căutat.
vi: Nhập URL của trang web cung cấp dịch vụ từ điển hoặc dịch thuật. Dùng {word} làm chỗ giữ chỗ cho từ cần tra.

source: Spell Check Program:
ro: Programul de verificare a ortografiei:
vi: Chương trình kiểm tra chính tả:

source: <i>The spell check program can be 'enchant-2', 'aspell', 'ispell' or any other spell check program which is compatible to the ispell command. The icon shows whether the entered command exists.</i>
ro: <i>Programul de verificare a ortografiei poate fi „enchant-2”, „aspell”, „ispell” sau orice alt program de verificare a ortografiei care este compatibil cu comanda «ispell». Pictograma indică dacă comanda introdusă există.</i>
vi: <i>Chương trình kiểm tra chính tả có thể là 'enchant-2', 'aspell', 'ispell' hoặc bất kỳ chương trình nào tương thích với lệnh ispell. Biểu tượng sẽ cho biết lệnh đã nhập có tồn tại hay không.</i>

source: This works with Ollama or any service that implements its HTTP API. HTTPS is not supported. Services like ChatGPT or Gemini are not supported, and there are no plans to add support. The prompt must include a %s placeholder where the search term will be inserted.
ro: Acesta funcționează cu Ollama sau cu orice serviciu care implementează API-ul său HTTP. HTTPS nu este acceptat. Servicii precum ChatGPT sau Gemini nu sunt acceptate și nu există planuri pentru adăugarea de suport. Solicitarea trebuie să includă un spațiu rezervat %s în care va fi introdus termenul de căutare.
vi: Tính năng này hoạt động với Ollama hoặc bất kỳ dịch vụ nào triển khai HTTP API của nó. HTTPS không được hỗ trợ. Các dịch vụ như ChatGPT hay Gemini không được hỗ trợ và hiện không có kế hoạch hỗ trợ. Prompt phải chứa chỗ giữ chỗ %s để chèn từ cần tra.

source: Model:
vi: Mô hình:

source: Reset
ro: Reinițializează
vi: Đặt lại

source: LLM
ro: MLM (LLM-eng.)

source: _LLM
ro: _MLM
